public/sql-inbox.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-04-04 Sun 18:08 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>SQL</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="themes/assets/rose-red.png" type="image/x-icon" />
           <link rel="stylesheet" href="themes/style.css" type="text/css"  />
</head>
<body>
<div id="content">
<h1 class="title">SQL</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org62a390f">Inbox</a>
<ul>
<li><a href="#org01a2664">为什么需要数据库</a></li>
<li><a href="#org654e2c0">数据模型</a></li>
<li><a href="#orga6cbab8">数据类型</a></li>
<li><a href="#org2f894ff">SQL 语言</a></li>
<li><a href="#org5d27685">主流关系数据库</a></li>
</ul>
</li>
<li><a href="#org96c23b3">关系模型</a>
<ul>
<li><a href="#org719d391">主键</a></li>
<li><a href="#org44336e5">外键</a></li>
<li><a href="#org678ab61"><span class="todo TODO">TODO</span> 索引</a></li>
</ul>
</li>
<li><a href="#orgae06ac0">查询数据</a>
<ul>
<li><a href="#org1f10c81">基本查询</a></li>
<li><a href="#org3d03854">条件查询</a></li>
<li><a href="#org5e5b5fd">投影查询</a></li>
<li><a href="#org6afce15">排序</a></li>
<li><a href="#org7b21feb">分页查询</a></li>
<li><a href="#org87e789b">聚合查询</a></li>
<li><a href="#org2ac5e33">多表查询</a></li>
<li><a href="#org17f732c"><span class="todo TODO">TODO</span> 连接查询</a></li>
</ul>
</li>
<li><a href="#org223f5c4">修改数据</a>
<ul>
<li><a href="#orgef92b02">INSERT</a></li>
<li><a href="#orgceccfaf">UPDATE</a></li>
<li><a href="#org1d16126">DELETE</a></li>
</ul>
</li>
<li><a href="#orga260040">MySQL</a>
<ul>
<li><a href="#orgc47d8c4">Client &amp; Server</a></li>
<li><a href="#org6588d82">管理 MySQL</a></li>
<li><a href="#orgdd05313"><span class="todo TODO">TODO</span> 实用 SQL 语句</a></li>
</ul>
</li>
<li><a href="#org0a9cfce"><span class="todo TODO">TODO</span> 事务</a></li>
</ul>
</div>
</div>

<div id="outline-container-org62a390f" class="outline-2">
<h2 id="org62a390f">Inbox</h2>
<div class="outline-text-2" id="text-org62a390f">
<p>
→ 摘录自廖雪峰老师的 <a href="https://www.liaoxuefeng.com/wiki/1177760294764384">https://www.liaoxuefeng.com/wiki/1177760294764384</a>
</p>

<p>
SQL（Structured Query Language 结构化查询语言），是访问和处理 <b>关系数据库</b> 的计算机标准语言，用来访问和操作数据库系统。
</p>
</div>

<div id="outline-container-org01a2664" class="outline-3">
<h3 id="org01a2664">为什么需要数据库</h3>
<div class="outline-text-3" id="text-org01a2664">
<p>
要保存用户的数据，一个最简单的方法是把用户数据写入文件。但是，随着应用程序的功能越来越复杂，数据量越来越大，如何管理这些数据就成了大问题：
</p>

<ul class="org-ul">
<li>读写文件并解析出数据需要大量重复代码；</li>
<li>从成千上万的数据中快速查询出指定数据需要复杂的逻辑。</li>
</ul>

<p>
如果每个应用程序都各自写自己的读写数据的代码，低效且易错；另一方面，每个应用程序访问数据的接口都不相同，数据难以复用。
</p>

<p>
所以，数据库作为一种专门管理数据的软件就出现了。应用程序不需要自己管理数据，而是通过数据库软件提供的接口来读写数据。至于数据本身如何存储到文件，那是数据库软件的事情，应用程序自己并不关心。
</p>

<essay>
通用性，就需要统一的标准！
<p>数据库软件其实就是你的数据中介，她们接收统一的指令。</p>
</essay>
</div>
</div>

<div id="outline-container-org654e2c0" class="outline-3">
<h3 id="org654e2c0">数据模型</h3>
<div class="outline-text-3" id="text-org654e2c0">
<p>
数据库按照数据结构来组织、存储和管理数据，实际上，数据库一共有三种模型：层次模型（树状）、网状模型和关系模型（二维表格）。
</p>

<p>
*关系数据库的关系模型是基于数学理论建立的。
</p>
</div>
</div>

<div id="outline-container-orga6cbab8" class="outline-3">
<h3 id="orga6cbab8">数据类型</h3>
<div class="outline-text-3" id="text-orga6cbab8">
<p>
对于一个关系表，除了定义每一列的名称外，还需要定义每一列的数据类型。关系数据库支持的标准数据类型包括数值、字符串、时间等：
</p>

<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">类型</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">INT</td>
<td class="org-left">整型</td>
<td class="org-left">4字节整数类型，范围约+/-21亿</td>
</tr>

<tr>
<td class="org-left">BIGINT</td>
<td class="org-left">长整型</td>
<td class="org-left">8字节整数类型，范围约+/-922亿亿</td>
</tr>

<tr>
<td class="org-left">REAL</td>
<td class="org-left">浮点型</td>
<td class="org-left">4字节浮点数，范围约+/-1038</td>
</tr>

<tr>
<td class="org-left">DOUBLE</td>
<td class="org-left">浮点型</td>
<td class="org-left">8字节浮点数，范围约+/-10308</td>
</tr>

<tr>
<td class="org-left">DECIMAL(M,N)</td>
<td class="org-left">高精度小数</td>
<td class="org-left">由用户指定精度的小数，例如， <code>DECIMAL(20,10)</code> 表示一共20位，其中小数10位，通常用于财务计算</td>
</tr>

<tr>
<td class="org-left">CHAR(N)</td>
<td class="org-left">定长字符串</td>
<td class="org-left">存储指定长度的字符串，例如， <code>CHAR(100)</code> 总是存储100个字符的字符串</td>
</tr>

<tr>
<td class="org-left">VARCHAR(N)</td>
<td class="org-left">变长字符串</td>
<td class="org-left">存储可变长度的字符串，例如， <code>VARCHAR(100)</code> 可以存储0~100个字符的字符串</td>
</tr>

<tr>
<td class="org-left">BOOLEAN</td>
<td class="org-left">布尔类型</td>
<td class="org-left">存储True或者False</td>
</tr>

<tr>
<td class="org-left">DATE</td>
<td class="org-left">日期类型</td>
<td class="org-left">存储日期，例如，2018-06-22</td>
</tr>

<tr>
<td class="org-left">TIME</td>
<td class="org-left">时间类型</td>
<td class="org-left">存储时间，例如，12:20:59</td>
</tr>

<tr>
<td class="org-left">DATETIME</td>
<td class="org-left">日期和时间类型</td>
<td class="org-left">存储日期+时间，例如，2018-06-22 12:20:59</td>
</tr>
</tbody>
</table>

<p>
*各数据库厂商还会支持特定的数据类型，例如 JSON 。
</p>
</div>
</div>

<div id="outline-container-org2f894ff" class="outline-3">
<h3 id="org2f894ff">SQL 语言</h3>
<div class="outline-text-3" id="text-org2f894ff">
<p>
什么是SQL？SQL是结构化查询语言的缩写，用来访问和操作数据库系统。
</p>

<p>
总的来说，SQL语言定义了这么几种操作数据库的能力：
</p>

<p>
1.DDL（Data Definition Language）允许用户定义数据，也就是创建表、删除表、修改表结构这些操作。通常，DDL由数据库管理员执行。
</p>

<p>
2.DML（Data Manipulation Language）为用户提供添加、删除、更新数据的能力，这些是应用程序对数据库的日常操作。
</p>

<p>
3.DQL（Data Query Language）允许用户查询数据，这也是通常最频繁的数据库日常操作。
</p>

<p>
*SQL语言关键字不区分大小写！！！
</p>
</div>
</div>

<div id="outline-container-org5d27685" class="outline-3">
<h3 id="org5d27685">主流关系数据库</h3>
<div class="outline-text-3" id="text-org5d27685">
<p>
目前，主流的关系数据库主要分为以下几类：
</p>

<ul class="org-ul">
<li>商用数据库，例如：Oracle，SQL Server，DB2等；</li>
<li>开源数据库，例如：MySQL，PostgreSQL等；</li>
<li>桌面数据库，以微软Access为代表，适合桌面应用程序使用；</li>
<li>嵌入式数据库，以Sqlite为代表，适合手机应用和桌面程序。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org96c23b3" class="outline-2">
<h2 id="org96c23b3">关系模型</h2>
<div class="outline-text-2" id="text-org96c23b3">
<p>
关系数据库是建立在关系模型上的，而关系模型本质上就是若干个存储数据的二维表。
</p>

<p>
在关系数据库中，关系是通过主键和外键来维护的。
</p>
</div>

<div id="outline-container-org719d391" class="outline-3">
<h3 id="org719d391">主键</h3>
<div class="outline-text-3" id="text-org719d391">
<p>
在关系数据库中，一张表中的每一行数据被称为一条记录（record）。每一条记录都包含若干定义好的字段。同一个表的所有记录都有相同的字段定义。
</p>

<p>
对于关系表，有个很重要的约束，就是 <b>任意两条记录不能重复</b> 。不能重复不是指两条记录不完全相同，而是指能够 <b>通过某个字段唯一区分出不同的记录</b> ，这个字段被称为 <span class="underline">主键</span> 。
</p>

<p>
<b>！选取主键的一个基本原则是：不使用任何业务相关的字段作为主键。</b>
</p>

<p>
我们一般把这个字段命名为id。常见的可作为id字段的类型有：
</p>

<ul class="org-ul">
<li>自增整数类型；</li>
<li>全局唯一GUID类型，类似于 <code>8f55d96b-8acc-4636-8cb8-76bf8abc2f57</code> 。</li>
</ul>

<p>
关系数据库实际上还允许通过多个字段唯一标识记录，即两个或更多的字段都设置为主键，这种主键被称为 <span class="underline">联合主键</span> （并不常用）。
</p>
</div>
</div>

<div id="outline-container-org44336e5" class="outline-3">
<h3 id="org44336e5">外键</h3>
<div class="outline-text-3" id="text-org44336e5">
<p>
把数据与另一张表关联起来，这种列称为 <span class="underline">外键</span> 。
</p>

<p>
外键并不是通过列名实现的，而是通过定义外键约束实现的，如：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: SystemWindowText;">students</span>
<span class="linenr">2: </span><span style="color: #a020f0;">ADD</span> <span style="color: #a020f0;">CONSTRAINT</span> fk_class_id      <span style="color: #7f7f7f;">-- &#22806;&#38190;&#32422;&#26463;&#30340;&#21517;&#31216;</span>
<span class="linenr">3: </span><span style="color: #a020f0;">FOREIGN</span> <span style="color: #a020f0;">KEY</span> <span style="color: #707183;">(</span>class_id<span style="color: #707183;">)</span>          <span style="color: #7f7f7f;">-- &#25351;&#23450;&#20102;class_id&#20316;&#20026;&#22806;&#38190;</span>
<span class="linenr">4: </span><span style="color: #a020f0;">REFERENCES</span> classes <span style="color: #707183;">(</span>id<span style="color: #707183;">)</span>;        <span style="color: #7f7f7f;">-- &#25351;&#23450;&#20102;&#36825;&#20010;&#22806;&#38190;&#23558;&#20851;&#32852;&#21040;classes&#34920;&#30340;id&#21015;</span>
</pre>
</div>

<p>
通过定义外键约束，关系数据库可以保证无法插入无效的数据。
</p>

<blockquote>
<p>
*注：由于外键约束会降低数据库的性能，大部分互联网应用程序为了追求速度，并不设置外键约束，而是仅靠应用程序自身来保证逻辑的正确性。这种情况下， <code>class_id</code> 仅仅是一个普通的列，只是它起到了外键的作用而已。
</p>
</blockquote>

<p>
要删除一个外键约束，也是通过ALTER TABLE实现的：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: SystemWindowText;">students</span>
<span class="linenr">2: </span><span style="color: #a020f0;">DROP</span> <span style="color: #a020f0;">FOREIGN</span> <span style="color: #a020f0;">KEY</span> fk_class_id;
</pre>
</div>

<p>
*注意：删除外键约束并没有删除外键这一列。删除列是通过 <code>DROP COLUMN ...</code> 实现的。
</p>

<hr>

<p>
通过一个表的外键关联到另一个表，我们可以定义出一对多关系。
</p>

<p>
多对多关系实际上是通过两个一对多关系实现的，即通过一个中间表，关联两个一对多关系，就形成了多对多关系。
</p>

<p>
一对一关系是指，一个表的记录对应到另一个表的唯一一个记录。
</p>

<blockquote>
<p>
*注：关系数据库通过外键可以实现一对多、多对多和一对一的关系。外键既可以通过数据库来约束，也可以不设置约束，仅依靠应用程序的逻辑来保证。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org678ab61" class="outline-3">
<h3 id="org678ab61"><span class="todo TODO">TODO</span> 索引</h3>
<div class="outline-text-3" id="text-org678ab61">
<p>
数据库索引对于用户和应用程序来说都是透明的。
</p>

<p>
……
</p>
</div>
</div>
</div>

<div id="outline-container-orgae06ac0" class="outline-2">
<h2 id="orgae06ac0">查询数据</h2>
<div class="outline-text-2" id="text-orgae06ac0">
</div>
<div id="outline-container-org1f10c81" class="outline-3">
<h3 id="org1f10c81">基本查询</h3>
<div class="outline-text-3" id="text-org1f10c81">
<pre class="example">
SELECT * FROM &lt;表名&gt;
</pre>
</div>
</div>

<div id="outline-container-org3d03854" class="outline-3">
<h3 id="org3d03854">条件查询</h3>
<div class="outline-text-3" id="text-org3d03854">
<pre class="example">
SELECT * FROM &lt;表名&gt; WHERE &lt;条件表达式&gt;
</pre>

<p>
如果不加括号，条件运算按照 <code>NOT、AND、OR</code> 的优先级进行。
</p>
</div>
</div>

<div id="outline-container-org5e5b5fd" class="outline-3">
<h3 id="org5e5b5fd">投影查询</h3>
<div class="outline-text-3" id="text-org5e5b5fd">
<p>
如果我们只希望返回某些列的数据，而不是所有列的数据，我们可以用 <code>SELECT 列1, 列2, 列3 FROM ...</code> ，让结果集仅包含指定列。这种操作称为投影查询。
</p>

<p>
还可以给每一列起个别名，这样，结果集的列名就可以与原表的列名不同。它的语法是 <code>SELECT 列1 别名1, 列2 别名2, 列3 别名3 FROM ...</code> 。
</p>
</div>
</div>
