org/sql-inbox.org
** 排序

 使用 =ORDER BY= 可以对结果集进行排序，默认的排序规则是 =ASC= ：“升序”，即从小到大， =ASC= 可以省略。 =DESC= 表示“倒序” 。要进一步排序，可以继续添加列名。如：

 #+BEGIN_SRC sql -n
   SELECT id, name, gender, score FROM students ORDER BY score; -- 升序
   SELECT id, name, gender, score FROM students ORDER BY score DESC; -- 降序
   SELECT id, name, gender, score FROM students ORDER BY score DESC, gender; -- 多列排序
 #+END_SRC

** 分页查询

 分页实际上就是从结果集中“截取”出第 M~N 条记录。这个查询可以通过 =LIMIT <M> OFFSET <N>= 子句实现，表示从 =N= 记录开始，最多取 =M= 条。

 分页查询的关键在于，首先要确定每页需要显示的结果数量 =pageSize= （这里是3），然后根据当前页的索引 =pageIndex= （从1开始），确定 =LIMIT= 和 =OFFSET= 应该设定的值：

 - =LIMIT= 总是设定为 =pageSize= ；
 - =OFFSET= 计算公式为 =pageSize * (pageIndex - 1)= 。

 这样就能正确查询出第N页的记录集。

 =OFFSET= 超过了查询的最大数量并不会报错，而是得到一个空的结果集。它是可选的，如果只写 =LIMIT 15= ，那么相当于 =LIMIT 15 OFFSET 0= 。

** 聚合查询

 对于统计总数、平均数这类计算，SQL 提供了专门的聚合函数，使用聚合函数进行查询，就是 _聚合查询_ ，它可以快速获得结果。

 如以查询 =students= 表一共有多少条记录为例，我们可以使用SQL内置的 =COUNT()= 函数查询：

 #+BEGIN_SRC sql -n
   SELECT COUNT(*) FROM students;
   -- 使用聚合查询时，我们应该给列名设置一个别名，便于处理结果
   SELECT COUNT(*) num FROM students;

 #+END_SRC

 =COUNT(*)= 表示查询所有列的行数，要注意聚合的计算结果虽然是一个数字，但查询的结果仍然是一个二维表，只是这个二维表只有一行一列，并且列名是 =COUNT(*)= 。除了 =COUNT()= 函数外，SQL还提供了如下聚合函数：

| 函数 | 	说明                           |
|------+----------------------------------------|
| SUM  | 计算某一列的合计值，该列必须为数值类型 |
| AVG  | 计算某一列的平均值，该列必须为数值类型 |
| MAX  | 计算某一列的最大值                     |
| MIN  | 计算某一列的最小值                     |

-----
*分组*

对于聚合查询，SQL还提供了“分组聚合”的功能。 如：

#+BEGIN_SRC sql -n
  SELECT COUNT(*) num FROM students GROUP BY class_id;
  -- 可以把 class_id 列也放入结果集中
  SELECT class_id, COUNT(*) num FROM students GROUP BY class_id;
  -- 也可以使用多个列进行分组
  SELECT class_id, gender, COUNT(*) num FROM students GROUP BY class_id, gender;

#+END_SRC

执行该 SELECT 语句时，会把 =class_id= 相同的列先分组，再分别计算，因此，得到了 3 行结果。

*注意：聚合查询的列中，只能放入分组的列。

** 多表查询

查询多张表的语法是： =SELECT * FROM <表1>, <表2>= 。

这种多表查询又称笛卡尔查询，结果集的列数是两表的列数之和，行数是两表的行数之积。

们仍然可以利用投影查询的“设置列的别名”来给两个表各自的 =id= 和 =name= 列起别名：

#+BEGIN_SRC sql -n
  SELECT
      students.id sid,
      students.name,
      students.gender,
      students.score,
      classes.id cid,
      classes.name cname
  FROM students, classes;

  -- 还允许给表设置一个别名，以简化 表名·列名
  SELECT
      s.id sid,
      s.name,
      s.gender,
      s.score,
      c.id cid,
      c.name cname
  FROM students s, classes c;
#+END_SRC

*多表查询也是可以添加 =WHERE= 条件的。

** TODO 连接查询

……

* 修改数据

关系数据库的基本操作就是增删改查，即 =CRUD：Create、Retrieve、Update、Delete= 。

** INSERT

INSERT语句的基本语法是：

#+BEGIN_EXAMPLE
INSERT INTO <表名> (字段1, 字段2, ...) VALUES (值1, 值2, ...);
#+END_EXAMPLE

- 对于自增主键，它的值可以由数据库自己推算出来，可以不列出；
- 字段顺序不必和数据库表的字段顺序一致，但值的顺序必须和字段顺序一致；
- 还可以一次性添加多条记录。

#+BEGIN_SRC sql -n
INSERT INTO students (class_id, name, gender, score) VALUES
  (1, '大宝', 'M', 87),
  (2, '二宝', 'M', 81);

SELECT * FROM students;
#+END_SRC

** UPDATE

UPDATE语句的基本语法是：

#+BEGIN_EXAMPLE
UPDATE <表名> SET 字段1=值1, 字段2=值2, ... WHERE ...;
#+END_EXAMPLE

UPDATE 语句可以没有 WHERE 条件，这时，整个表的所有记录都会被更新。

** DELETE

DELETE语句的基本语法是：

#+BEGIN_EXAMPLE
DELETE FROM <表名> WHERE ...;
#+END_EXAMPLE

和 UPDATE 类似，不带 WHERE 条件的 DELETE 语句会删除整个表的数据。

* MySQL

** Client & Server

 命令行程序 =mysql= 实际上是 MySQL 客户端，真正的 MySQL 服务器程序是 =mysqld= ，在后台运行。

 在 MySQL Client 中输入的SQL语句通过 TCP 连接发送到 MySQL Server。默认端口号是 =3306= ，即如果发送到本机 MySQL Server，地址就是 =127.0.0.1:3306= 。

 也可以只安装 MySQL Client，然后连接到远程 MySQL Server。假设远程 MySQL Server 的 IP 地址是 =10.0.1.99= ，那么就使用 =-h= 指定 IP 或域名：

 #+BEGIN_EXAMPLE
 mysql -h 10.0.1.99 -u root -p
 #+END_EXAMPLE

