public/sql-inbox.html

<div id="outline-container-org6afce15" class="outline-3">
<h3 id="org6afce15">排序</h3>
<div class="outline-text-3" id="text-org6afce15">
<p>
使用 <code>ORDER BY</code> 可以对结果集进行排序，默认的排序规则是 <code>ASC</code> ：“升序”，即从小到大， <code>ASC</code> 可以省略。 <code>DESC</code> 表示“倒序” 。要进一步排序，可以继续添加列名。如：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">SELECT</span> id, <span style="color: #a020f0;">name</span>, gender, score <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">ORDER</span> <span style="color: #a020f0;">BY</span> score; <span style="color: #7f7f7f;">-- &#21319;&#24207;</span>
<span class="linenr">2: </span><span style="color: #a020f0;">SELECT</span> id, <span style="color: #a020f0;">name</span>, gender, score <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">ORDER</span> <span style="color: #a020f0;">BY</span> score <span style="color: #a020f0;">DESC</span>; <span style="color: #7f7f7f;">-- &#38477;&#24207;</span>
<span class="linenr">3: </span><span style="color: #a020f0;">SELECT</span> id, <span style="color: #a020f0;">name</span>, gender, score <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">ORDER</span> <span style="color: #a020f0;">BY</span> score <span style="color: #a020f0;">DESC</span>, gender; <span style="color: #7f7f7f;">-- &#22810;&#21015;&#25490;&#24207;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b21feb" class="outline-3">
<h3 id="org7b21feb">分页查询</h3>
<div class="outline-text-3" id="text-org7b21feb">
<p>
分页实际上就是从结果集中“截取”出第 M~N 条记录。这个查询可以通过 <code>LIMIT &lt;M&gt; OFFSET &lt;N&gt;</code> 子句实现，表示从 <code>N</code> 记录开始，最多取 <code>M</code> 条。
</p>

<p>
分页查询的关键在于，首先要确定每页需要显示的结果数量 <code>pageSize</code> （这里是3），然后根据当前页的索引 <code>pageIndex</code> （从1开始），确定 <code>LIMIT</code> 和 <code>OFFSET</code> 应该设定的值：
</p>

<ul class="org-ul">
<li><code>LIMIT</code> 总是设定为 <code>pageSize</code> ；</li>
<li><code>OFFSET</code> 计算公式为 <code>pageSize * (pageIndex - 1)</code> 。</li>
</ul>

<p>
这样就能正确查询出第N页的记录集。
</p>

<p>
<code>OFFSET</code> 超过了查询的最大数量并不会报错，而是得到一个空的结果集。它是可选的，如果只写 <code>LIMIT 15</code> ，那么相当于 <code>LIMIT 15 OFFSET 0</code> 。
</p>
</div>
</div>

<div id="outline-container-org87e789b" class="outline-3">
<h3 id="org87e789b">聚合查询</h3>
<div class="outline-text-3" id="text-org87e789b">
<p>
对于统计总数、平均数这类计算，SQL 提供了专门的聚合函数，使用聚合函数进行查询，就是 <span class="underline">聚合查询</span> ，它可以快速获得结果。
</p>

<p>
如以查询 <code>students</code> 表一共有多少条记录为例，我们可以使用SQL内置的 <code>COUNT()</code> 函数查询：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">SELECT</span> <span style="color: #a020f0;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> <span style="color: #a020f0;">FROM</span> students;
<span class="linenr">2: </span><span style="color: #7f7f7f;">-- &#20351;&#29992;&#32858;&#21512;&#26597;&#35810;&#26102;&#65292;&#25105;&#20204;&#24212;&#35813;&#32473;&#21015;&#21517;&#35774;&#32622;&#19968;&#20010;&#21035;&#21517;&#65292;&#20415;&#20110;&#22788;&#29702;&#32467;&#26524;</span>
<span class="linenr">3: </span><span style="color: #a020f0;">SELECT</span> <span style="color: #a020f0;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> num <span style="color: #a020f0;">FROM</span> students;
<span class="linenr">4: </span>
</pre>
</div>

<p>
<code>COUNT(*)</code> 表示查询所有列的行数，要注意聚合的计算结果虽然是一个数字，但查询的结果仍然是一个二维表，只是这个二维表只有一行一列，并且列名是 <code>COUNT(*)</code> 。除了 <code>COUNT()</code> 函数外，SQL还提供了如下聚合函数：
</p>

<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">函数</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SUM</td>
<td class="org-left">计算某一列的合计值，该列必须为数值类型</td>
</tr>

<tr>
<td class="org-left">AVG</td>
<td class="org-left">计算某一列的平均值，该列必须为数值类型</td>
</tr>

<tr>
<td class="org-left">MAX</td>
<td class="org-left">计算某一列的最大值</td>
</tr>

<tr>
<td class="org-left">MIN</td>
<td class="org-left">计算某一列的最小值</td>
</tr>
</tbody>
</table>

<hr>
<p>
<b>分组</b>
</p>

<p>
对于聚合查询，SQL还提供了“分组聚合”的功能。 如：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">SELECT</span> <span style="color: #a020f0;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> num <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">GROUP</span> <span style="color: #a020f0;">BY</span> class_id;
<span class="linenr">2: </span><span style="color: #7f7f7f;">-- &#21487;&#20197;&#25226; class_id &#21015;&#20063;&#25918;&#20837;&#32467;&#26524;&#38598;&#20013;</span>
<span class="linenr">3: </span><span style="color: #a020f0;">SELECT</span> class_id, <span style="color: #a020f0;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> num <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">GROUP</span> <span style="color: #a020f0;">BY</span> class_id;
<span class="linenr">4: </span><span style="color: #7f7f7f;">-- &#20063;&#21487;&#20197;&#20351;&#29992;&#22810;&#20010;&#21015;&#36827;&#34892;&#20998;&#32452;</span>
<span class="linenr">5: </span><span style="color: #a020f0;">SELECT</span> class_id, gender, <span style="color: #a020f0;">COUNT</span><span style="color: #707183;">(</span>*<span style="color: #707183;">)</span> num <span style="color: #a020f0;">FROM</span> students <span style="color: #a020f0;">GROUP</span> <span style="color: #a020f0;">BY</span> class_id, gender;
<span class="linenr">6: </span>
</pre>
</div>

<p>
执行该 SELECT 语句时，会把 <code>class_id</code> 相同的列先分组，再分别计算，因此，得到了 3 行结果。
</p>

<p>
*注意：聚合查询的列中，只能放入分组的列。
</p>
</div>
</div>

<div id="outline-container-org2ac5e33" class="outline-3">
<h3 id="org2ac5e33">多表查询</h3>
<div class="outline-text-3" id="text-org2ac5e33">
<p>
查询多张表的语法是： <code>SELECT * FROM &lt;表1&gt;, &lt;表2&gt;</code> 。
</p>

<p>
这种多表查询又称笛卡尔查询，结果集的列数是两表的列数之和，行数是两表的行数之积。
</p>

<p>
们仍然可以利用投影查询的“设置列的别名”来给两个表各自的 <code>id</code> 和 <code>name</code> 列起别名：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr"> 1: </span><span style="color: #a020f0;">SELECT</span>
<span class="linenr"> 2: </span>    students.id sid,
<span class="linenr"> 3: </span>    students.<span style="color: #a020f0;">name</span>,
<span class="linenr"> 4: </span>    students.gender,
<span class="linenr"> 5: </span>    students.score,
<span class="linenr"> 6: </span>    classes.id cid,
<span class="linenr"> 7: </span>    classes.<span style="color: #a020f0;">name</span> cname
<span class="linenr"> 8: </span><span style="color: #a020f0;">FROM</span> students, classes;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #7f7f7f;">-- &#36824;&#20801;&#35768;&#32473;&#34920;&#35774;&#32622;&#19968;&#20010;&#21035;&#21517;&#65292;&#20197;&#31616;&#21270; &#34920;&#21517;&#183;&#21015;&#21517;</span>
<span class="linenr">11: </span><span style="color: #a020f0;">SELECT</span>
<span class="linenr">12: </span>    s.id sid,
<span class="linenr">13: </span>    s.<span style="color: #a020f0;">name</span>,
<span class="linenr">14: </span>    s.gender,
<span class="linenr">15: </span>    s.score,
<span class="linenr">16: </span>    c.id cid,
<span class="linenr">17: </span>    c.<span style="color: #a020f0;">name</span> cname
<span class="linenr">18: </span><span style="color: #a020f0;">FROM</span> students s, classes c;
</pre>
</div>

<p>
*多表查询也是可以添加 <code>WHERE</code> 条件的。
</p>
</div>
</div>

<div id="outline-container-org17f732c" class="outline-3">
<h3 id="org17f732c"><span class="todo TODO">TODO</span> 连接查询</h3>
<div class="outline-text-3" id="text-org17f732c">
<p>
……
</p>
</div>
</div>
</div>

<div id="outline-container-org223f5c4" class="outline-2">
<h2 id="org223f5c4">修改数据</h2>
<div class="outline-text-2" id="text-org223f5c4">
<p>
关系数据库的基本操作就是增删改查，即 <code>CRUD：Create、Retrieve、Update、Delete</code> 。
</p>
</div>

<div id="outline-container-orgef92b02" class="outline-3">
<h3 id="orgef92b02">INSERT</h3>
<div class="outline-text-3" id="text-orgef92b02">
<p>
INSERT语句的基本语法是：
</p>

<pre class="example">
INSERT INTO &lt;表名&gt; (字段1, 字段2, ...) VALUES (值1, 值2, ...);
</pre>

<ul class="org-ul">
<li>对于自增主键，它的值可以由数据库自己推算出来，可以不列出；</li>
<li>字段顺序不必和数据库表的字段顺序一致，但值的顺序必须和字段顺序一致；</li>
<li>还可以一次性添加多条记录。</li>
</ul>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">INSERT</span> <span style="color: #a020f0;">INTO</span> students <span style="color: #707183;">(</span>class_id, <span style="color: #a020f0;">name</span>, gender, score<span style="color: #707183;">)</span> <span style="color: #a020f0;">VALUES</span>
<span class="linenr">2: </span>  <span style="color: #707183;">(</span>1, <span style="color: #8b2252;">'&#22823;&#23453;'</span>, <span style="color: #8b2252;">'M'</span>, 87<span style="color: #707183;">)</span>,
<span class="linenr">3: </span>  <span style="color: #707183;">(</span>2, <span style="color: #8b2252;">'&#20108;&#23453;'</span>, <span style="color: #8b2252;">'M'</span>, 81<span style="color: #707183;">)</span>;
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #a020f0;">SELECT</span> * <span style="color: #a020f0;">FROM</span> students;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgceccfaf" class="outline-3">
<h3 id="orgceccfaf">UPDATE</h3>
<div class="outline-text-3" id="text-orgceccfaf">
<p>
UPDATE语句的基本语法是：
</p>

<pre class="example">
UPDATE &lt;表名&gt; SET 字段1=值1, 字段2=值2, ... WHERE ...;
</pre>

<p>
UPDATE 语句可以没有 WHERE 条件，这时，整个表的所有记录都会被更新。
</p>
</div>
</div>

<div id="outline-container-org1d16126" class="outline-3">
<h3 id="org1d16126">DELETE</h3>
<div class="outline-text-3" id="text-org1d16126">
<p>
DELETE语句的基本语法是：
</p>

<pre class="example">
DELETE FROM &lt;表名&gt; WHERE ...;
</pre>

<p>
和 UPDATE 类似，不带 WHERE 条件的 DELETE 语句会删除整个表的数据。
</p>
</div>
</div>
</div>

<div id="outline-container-orga260040" class="outline-2">
<h2 id="orga260040">MySQL</h2>
<div class="outline-text-2" id="text-orga260040">
</div>
<div id="outline-container-orgc47d8c4" class="outline-3">
<h3 id="orgc47d8c4">Client &amp; Server</h3>
<div class="outline-text-3" id="text-orgc47d8c4">
<p>
命令行程序 <code>mysql</code> 实际上是 MySQL 客户端，真正的 MySQL 服务器程序是 <code>mysqld</code> ，在后台运行。
</p>

<p>
在 MySQL Client 中输入的SQL语句通过 TCP 连接发送到 MySQL Server。默认端口号是 <code>3306</code> ，即如果发送到本机 MySQL Server，地址就是 <code>127.0.0.1:3306</code> 。
</p>

<p>
也可以只安装 MySQL Client，然后连接到远程 MySQL Server。假设远程 MySQL Server 的 IP 地址是 <code>10.0.1.99</code> ，那么就使用 <code>-h</code> 指定 IP 或域名：
</p>

<pre class="example">
mysql -h 10.0.1.99 -u root -p
</pre>
</div>
</div>
