org/sql-inbox.org
** 管理 MySQL

在一个运行MySQL的服务器上，实际上可以创建多个数据库（Database）。

数据库相关：

| 操作                 | 说明            |
|----------------------+-----------------|
| SHOW databases;      | 列出所有数据库  |
| CREAT database test; | 创建数据库 test |
| DROP database test;  | 删除数据库 test |
| USE test;            | 切换数据库 test |

表相关：

| 操作                        | 说明                |
|-----------------------------+---------------------|
| SHOW tables;                | 列出                |
| DESC students;              | 查看表的结构        |
| SHOW create table students; | 查看创建表的SQL语句 |
| DROP table students;        | 删除                |

修改表就比较复杂。如果要给 students 表新增一列 birth，使用：

#+BEGIN_SRC sql -n
  ALTER TABLE students ADD COLUMN birth VARCHAR(10) NOT NULL;
  -- 要修改birth列，例如把列名改为birthday，类型改为VARCHAR(20)
  ALTER TABLE students CHANGE COLUMN birth birthday VARCHAR(20) NOT NULL;
  -- 要删除列
  ALTER TABLE students DROP COLUMN birthday;
#+END_SRC

** TODO 实用 SQL 语句

……

* TODO 事务

这种把多条语句作为一个整体进行操作的功能，被称为 *数据库事务* 。

#+BEGIN_QUOTE
数据库事务可以确保该事务范围内的所有操作都可以全部成功或者全部失败。如果事务失败，那么效果就和没有执行这些SQL一样，不会对数据库数据有任何改动。
#+END_QUOTE

对于单条SQL语句，数据库系统自动将其作为一个事务执行，这种事务被称为隐式事务。

要手动把多条SQL语句作为一个事务执行，使用 =BEGIN= 开启一个事务，使用 =COMMIT= 提交一个事务，这种事务被称为显式事务。

很显然多条SQL语句要想作为一个事务执行，就必须使用显式事务。

=COMMIT= 是指提交事务，即试图把事务内的所有SQL所做的修改永久保存。如果 =COMMIT= 语句执行失败了，整个事务也会失败。

有些时候，我们希望主动让事务失败，这时，可以用 =ROLLBACK= 回滚事务，整个事务会失败。
