public/sql-inbox.html

<div id="outline-container-org6588d82" class="outline-3">
<h3 id="org6588d82">管理 MySQL</h3>
<div class="outline-text-3" id="text-org6588d82">
<p>
在一个运行MySQL的服务器上，实际上可以创建多个数据库（Database）。
</p>

<p>
数据库相关：
</p>

<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">操作</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SHOW databases;</td>
<td class="org-left">列出所有数据库</td>
</tr>

<tr>
<td class="org-left">CREAT database test;</td>
<td class="org-left">创建数据库 test</td>
</tr>

<tr>
<td class="org-left">DROP database test;</td>
<td class="org-left">删除数据库 test</td>
</tr>

<tr>
<td class="org-left">USE test;</td>
<td class="org-left">切换数据库 test</td>
</tr>
</tbody>
</table>

<p>
表相关：
</p>

<table>

<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">操作</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">SHOW tables;</td>
<td class="org-left">列出</td>
</tr>

<tr>
<td class="org-left">DESC students;</td>
<td class="org-left">查看表的结构</td>
</tr>

<tr>
<td class="org-left">SHOW create table students;</td>
<td class="org-left">查看创建表的SQL语句</td>
</tr>

<tr>
<td class="org-left">DROP table students;</td>
<td class="org-left">删除</td>
</tr>
</tbody>
</table>

<p>
修改表就比较复杂。如果要给 students 表新增一列 birth，使用：
</p>

<div class="org-src-container">
<pre class="src src-sql"><span class="linenr">1: </span><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: SystemWindowText;">students</span> <span style="color: #a020f0;">ADD</span> <span style="color: #a020f0;">COLUMN</span> birth <span style="color: #a020f0;">VARCHAR</span><span style="color: #707183;">(</span>10<span style="color: #707183;">)</span> <span style="color: #a020f0;">NOT</span> <span style="color: #a020f0;">NULL</span>;
<span class="linenr">2: </span><span style="color: #7f7f7f;">-- &#35201;&#20462;&#25913;birth&#21015;&#65292;&#20363;&#22914;&#25226;&#21015;&#21517;&#25913;&#20026;birthday&#65292;&#31867;&#22411;&#25913;&#20026;VARCHAR(20)</span>
<span class="linenr">3: </span><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: SystemWindowText;">students</span> CHANGE <span style="color: #a020f0;">COLUMN</span> birth birthday <span style="color: #a020f0;">VARCHAR</span><span style="color: #707183;">(</span>20<span style="color: #707183;">)</span> <span style="color: #a020f0;">NOT</span> <span style="color: #a020f0;">NULL</span>;
<span class="linenr">4: </span><span style="color: #7f7f7f;">-- &#35201;&#21024;&#38500;&#21015;</span>
<span class="linenr">5: </span><span style="color: #a020f0;">ALTER</span> <span style="color: #a020f0;">TABLE</span> <span style="color: SystemWindowText;">students</span> <span style="color: #a020f0;">DROP</span> <span style="color: #a020f0;">COLUMN</span> birthday;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd05313" class="outline-3">
<h3 id="orgdd05313"><span class="todo TODO">TODO</span> 实用 SQL 语句</h3>
<div class="outline-text-3" id="text-orgdd05313">
<p>
……
</p>
</div>
</div>
</div>

<div id="outline-container-org0a9cfce" class="outline-2">
<h2 id="org0a9cfce"><span class="todo TODO">TODO</span> 事务</h2>
<div class="outline-text-2" id="text-org0a9cfce">
<p>
这种把多条语句作为一个整体进行操作的功能，被称为 <b>数据库事务</b> 。
</p>

<blockquote>
<p>
数据库事务可以确保该事务范围内的所有操作都可以全部成功或者全部失败。如果事务失败，那么效果就和没有执行这些SQL一样，不会对数据库数据有任何改动。
</p>
</blockquote>

<p>
对于单条SQL语句，数据库系统自动将其作为一个事务执行，这种事务被称为隐式事务。
</p>

<p>
要手动把多条SQL语句作为一个事务执行，使用 <code>BEGIN</code> 开启一个事务，使用 <code>COMMIT</code> 提交一个事务，这种事务被称为显式事务。
</p>

<p>
很显然多条SQL语句要想作为一个事务执行，就必须使用显式事务。
</p>

<p>
<code>COMMIT</code> 是指提交事务，即试图把事务内的所有SQL所做的修改永久保存。如果 <code>COMMIT</code> 语句执行失败了，整个事务也会失败。
</p>

<p>
有些时候，我们希望主动让事务失败，这时，可以用 <code>ROLLBACK</code> 回滚事务，整个事务会失败。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2021-04-02 Fri 10:19</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2021-04-04 Sun 18:08</p>
<p class="validation"><a href="http://beian.miit.gov.cn/">豫ICP备19025929号</a></p>
</div>
</body>
</html>
